nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/can/processor/can_p32mk1024gpe100.h
} CAN_TX_RTR;

typedef enum {

    CAN_RX_DATA_ONLY = 0x00,
    CAN_RX_FULL_RECEIVE = 0x01

} CAN_RX_DATA_MODE;

typedef enum {

    CAN_FILTER_MASK_IDE_TYPE = 0x00,
    CAN_FILTER_MASK_ANY_TYPE = 0x01

} CAN_FILTER_MASK_TYPE;

typedef enum {

    CAN_LOWEST_PRIORITY = 0x00,
    CAN_LOW_MEDIUM_PRIORITY = 0x01,
    CAN_HIGH_MEDIUM_PRIORITY = 0x02,
    CAN_HIGHEST_PRIORITY = 0x03

} CAN_TXCHANNEL_PRIORITY;

typedef enum {

    CAN_DNET_FILTER_SIZE_18_BIT = 0x12,
    CAN_DNET_FILTER_SIZE_17_BIT = 0x11,
    CAN_DNET_FILTER_SIZE_16_BIT = 0x10,
    CAN_DNET_FILTER_SIZE_15_BIT = 0x0F,
    CAN_DNET_FILTER_SIZE_14_BIT = 0x0E,
    CAN_DNET_FILTER_SIZE_13_BIT = 0x0D,
    CAN_DNET_FILTER_SIZE_12_BIT = 0x0C,
    CAN_DNET_FILTER_SIZE_11_BIT = 0x0B,
    CAN_DNET_FILTER_SIZE_10_BIT = 0x0A,
    CAN_DNET_FILTER_SIZE_9_BIT = 0x09,
    CAN_DNET_FILTER_SIZE_8_BIT = 0x08,
    CAN_DNET_FILTER_SIZE_7_BIT = 0x07,
    CAN_DNET_FILTER_SIZE_6_BIT = 0x06,
    CAN_DNET_FILTER_SIZE_5_BIT = 0x05,
    CAN_DNET_FILTER_SIZE_4_BIT = 0x04,
    CAN_DNET_FILTER_SIZE_3_BIT = 0x03,
    CAN_DNET_FILTER_SIZE_2_BIT = 0x02,
    CAN_DNET_FILTER_SIZE_1_BIT = 0x01,
    CAN_DNET_FILTER_DISABLE = 0x00

} CAN_DNET_FILTER_SIZE;

typedef enum {

    CAN_TX_EVENT = 0x01,
    CAN_RX_EVENT = 0x02,
    CAN_TIMESTAMP_TIMER_OVERFLOW_EVENT = 0x04,
    CAN_OPERATION_MODE_CHANGE_EVENT = 0x08,
    CAN_RX_OVERFLOW_EVENT = 0x800,
    CAN_SYSTEM_ERROR_EVENT = 0x1000,
    CAN_BUS_ERROR_EVENT = 0x2000,
    CAN_BUS_ACTIVITY_WAKEUP_EVENT = 0x4000,
    CAN_INVALID_RX_MESSAGE_EVENT = 0x8000,
    CAN_All_EVENTS = 0xF80F

} CAN_MODULE_EVENT;

typedef enum {

    CAN_TX_RX_WARNING_STATE = 0x10000,
    CAN_RX_WARNING_STATE = 0x20000,
    CAN_TX_WARNING_STATE = 0x40000,
    CAN_RX_BUS_PASSIVE_STATE = 0x80000,
    CAN_TX_BUS_PASSIVE_STATE = 0x100000,
    CAN_TX_BUS_OFF_STATE = 0x200000

} CAN_ERROR_STATE;

typedef enum {

    CAN_EID = 0x00,
    CAN_SID = 0x01

} CAN_ID_TYPE;

typedef enum {

    CAN_CHANNEL0_MASK = 0x00000001,
    CAN_CHANNEL1_MASK = 0x00000002,
    CAN_CHANNEL2_MASK = 0x00000004,
    CAN_CHANNEL3_MASK = 0x00000008,
    CAN_CHANNEL4_MASK = 0x00000010,
    CAN_CHANNEL5_MASK = 0x00000020,
    CAN_CHANNEL6_MASK = 0x00000040,
    CAN_CHANNEL7_MASK = 0x00000080,
    CAN_CHANNEL8_MASK = 0x00000100,
    CAN_CHANNEL9_MASK = 0x00000200,
    CAN_CHANNEL10_MASK = 0x00000400,
    CAN_CHANNEL11_MASK = 0x00000800,
    CAN_CHANNEL12_MASK = 0x00001000,
    CAN_CHANNEL13_MASK = 0x00002000,
    CAN_CHANNEL14_MASK = 0x00004000,
    CAN_CHANNEL15_MASK = 0x00008000,
    CAN_ANYCHANNEL_MASK = 0x0000FFFF

} CAN_CHANNEL_MASK;

typedef enum {

    CAN_TX_CHANNEL_TRANSMITTING = 0x01,
    CAN_TX_CHANNEL_ERROR = 0x02,
    CAN_TX_CHANNEL_ARBITRATION_LOST = 0x04

} CAN_TX_CHANNEL_STATUS;

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/can_DeviceNet_Default.h"
#include "../templates/can_ActiveStatus_Default.h"
#include "../templates/can_StopInIdle_Default.h"
#include "../templates/can_EnableControl_Default.h"
#include "../templates/can_TimeStampEnable_Default.h"
#include "../templates/can_TimeStampValue_Default.h"
#include "../templates/can_BusActivityWakeup_Default.h"
#include "../templates/can_MemoryBufferAssign_Default.h"
#include "../templates/can_OperationModeRead_Default.h"
#include "../templates/can_OperationModeSet_Default.h"
#include "../templates/can_TimeStampPrescaler_Default.h"
#include "../templates/can_PhaseSegment2Length_Default.h"
#include "../templates/can_PhaseSegment1Length_Default.h"
#include "../templates/can_PhaseSegment2LengthFreelyProgrammable_Default.h"
#include "../templates/can_BusLine3TimesSampling_Default.h"
#include "../templates/can_PropagationTimeSegment_Default.h"
#include "../templates/can_SyncJumpWidth_Default.h"
#include "../templates/can_BaudRatePrescale_Default.h"
#include "../templates/can_BusSpeed_Default.h"
#include "../templates/can_ChannelReset_pic32.h"
#include "../templates/can_ChannelUpdate_pic32.h"
#include "../templates/can_ModuleEventEnable_Default.h"
#include "../templates/can_ModuleEvents_Default.h"
#include "../templates/can_ChannelEventEnable_pic32.h"
#include "../templates/can_PendingEventsGet_Default.h"
#include "../templates/can_AllChannelEvents_Default.h"
#include "../templates/can_AllChannelOverflow_Default.h"
#include "../templates/can_ChannelEventGet_Default.h"
#include "../templates/can_ChannelForTransmitSet_pic32.h"
#include "../templates/can_PendingTransmissionsAbort_Default.h"
#include "../templates/can_TransmitChannelFlush_pic32.h"
#include "../templates/can_TransmitChannelStatus_pic32.h"
#include "../templates/can_TransmitBufferGet_pic32.h"
#include "../templates/can_TransmissionAbortStatus_pic32.h"
#include "../templates/can_ReceivedMessageGet_pic32.h"
#include "../templates/can_ChannelForReceiveSet_pic32.h"
#include "../templates/can_FilterMaskConfigure_pic32.h"
#include "../templates/can_FilterConfigure_pic32.h"
#include "../templates/can_FilterEnable_pic32.h"
#include "../templates/can_LatestFilterMatchGet_pic32.h"
#include "../templates/can_FilterToChannelLink_pic32.h"
#include "../templates/can_ReceiveErrorCount_Default.h"
#include "../templates/can_TransmitErrorCountGet_Default.h"
#include "../templates/can_ErrorStateGet_Default.h"
#include "../templates/can_ModuleInformation_Default.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API void PLIB_CAN_DeviceNetConfigure(CAN_MODULE_ID index, CAN_DNET_FILTER_SIZE dncnt)
{
     CAN_DeviceNetConfigure_Default(index, dncnt);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsDeviceNet(CAN_MODULE_ID index)
{
     return CAN_ExistsDeviceNet_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_IsActive(CAN_MODULE_ID index)
{
     return CAN_IsActive_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsActiveStatus(CAN_MODULE_ID index)
{
     return CAN_ExistsActiveStatus_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_StopInIdleEnable(CAN_MODULE_ID index)
{
     CAN_StopInIdleEnable_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_StopInIdleDisable(CAN_MODULE_ID index)
{
     CAN_StopInIdleDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsStopInIdle(CAN_MODULE_ID index)
{
     return CAN_ExistsStopInIdle_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_Enable(CAN_MODULE_ID index)
{
     CAN_Enable_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_Disable(CAN_MODULE_ID index)
{
     CAN_Disable_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsEnableControl(CAN_MODULE_ID index)
{
     return CAN_ExistsEnableControl_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_TimeStampEnable(CAN_MODULE_ID index)
{
     CAN_TimeStampEnable_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_TimeStampDisable(CAN_MODULE_ID index)
{
     CAN_TimeStampDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsTimeStampEnable(CAN_MODULE_ID index)
{
     return CAN_ExistsTimeStampEnable_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_TimeStampValueSet(CAN_MODULE_ID index, unsigned value)
{
     CAN_TimeStampValueSet_Default(index, value);
}

PLIB_INLINE_API unsigned PLIB_CAN_TimeStampValueGet(CAN_MODULE_ID index)
{
     return CAN_TimeStampValueGet_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsTimeStampValue(CAN_MODULE_ID index)
{
     return CAN_ExistsTimeStampValue_Default(index);
}

